; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-4)
(:domain blocksworld)
(:objects b1 b2 b3 b4 )
(:init
(ontable b1)
(on b2 b3)
(on b3 b1)
(on b4 b2)
(clear b4)
)
(:goal
(and
(on b3 b2)
(on b4 b1))
)
)

; plan
1. (move-b-to-t b4 b2)
   deleted: (on b4 b2)
   added: (ontable b4) (clear b2)
   goals met: 0 of 2
2. (move-b-to-t b2 b3)
   deleted: (on b2 b3)
   added: (ontable b2) (clear b3)
   goals met: 0 of 2
3. (move-b-to-b b3 b1 b2)
   deleted: (clear b2) (on b3 b1)
   added: (on b3 b2) (clear b1)
   goals met: 1 of 2
4. (move-t-to-b b4 b1)
   deleted: (clear b1) (ontable b4)
   added: (on b4 b1)
   goals met: 2 of 2
